name: "VGG_ILSVRC_16_layers"

input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 224
  dim: 224
}

input: "rois"
input_shape {
  dim: 1 # to be changed on-the-fly to num ROIs
  dim: 5 # [batch ind, x1, y1, x2, y2] zero-based indexing
}
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_3"
  type: "Convolution"
  bottom: "conv4_2"
  top: "conv4_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "conv4_3"
  top: "conv4_3"
}


layer {
  name: "conv5_1"
  type: "Convolution"
#  bottom: "pool4"
  bottom: "conv4_3"
  top: "conv5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_1"
  type: "ReLU"
  bottom: "conv5_1"
  top: "conv5_1"
}
layer {
  name: "conv5_2"
  type: "Convolution"
  bottom: "conv5_1"
  top: "conv5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_2"
  type: "ReLU"
  bottom: "conv5_2"
  top: "conv5_2"
}
layer {
  name: "conv5_3"
  type: "Convolution"
  bottom: "conv5_2"
  top: "conv5_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_3"
  type: "ReLU"
  bottom: "conv5_3"
  top: "conv5_3"
}
layer {
  name: "roi_pool5"
  type: "ROIPooling"
  bottom: "conv5_3"
  bottom: "rois"
  top: "pool5"
  roi_pooling_param {
    pooled_w: 7
    pooled_h: 7
    #spatial_scale: 0.0625 # 1/16
    spatial_scale: 0.125 # 1/8
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "cls_score"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "fc7"
  top: "bbox_pred"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 8
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}


########## Branch 2 start with conv3  ###########

layer {
  name: "conv3_1_b"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_1_b"
  type: "ReLU"
  bottom: "conv3_1_b"
  top: "conv3_1_b"
}
layer {
  name: "conv3_2_b"
  type: "Convolution"
  bottom: "conv3_1_b"
  top: "conv3_2_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_2_b"
  type: "ReLU"
  bottom: "conv3_2_b"
  top: "conv3_2_b"
}
layer {
  name: "conv3_3_b"
  type: "Convolution"
  bottom: "conv3_2_b"
  top: "conv3_3_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_3_b"
  type: "ReLU"
  bottom: "conv3_3_b"
  top: "conv3_3_b"
}
layer {
  name: "pool3_b"
  type: "Pooling"
  bottom: "conv3_3_b"
  top: "pool3_b"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1_b"
  type: "Convolution"
  bottom: "pool3_b"
  top: "conv4_1_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_1_b"
  type: "ReLU"
  bottom: "conv4_1_b"
  top: "conv4_1_b"
}
layer {
  name: "conv4_2_b"
  type: "Convolution"
  bottom: "conv4_1_b"
  top: "conv4_2_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_2_b"
  type: "ReLU"
  bottom: "conv4_2_b"
  top: "conv4_2_b"
}
layer {
  name: "conv4_3_b"
  type: "Convolution"
  bottom: "conv4_2_b"
  top: "conv4_3_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_3_b"
  type: "ReLU"
  bottom: "conv4_3_b"
  top: "conv4_3_b"
}
#layer {
#  name: "pool4_b"
#  type: "Pooling"
#  bottom: "conv4_3_b"
#  top: "pool4_b"
#  pooling_param {
#    pool: MAX
#    kernel_size: 2
#    stride: 2
#  }
#}

layer {
  name: "conv5_1_b"
  type: "Convolution"
#  bottom: "pool4_b"
  bottom: "conv4_3_b"
  top: "conv5_1_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_1_b"
  type: "ReLU"
  bottom: "conv5_1_b"
  top: "conv5_1_b"
}
layer {
  name: "conv5_2_b"
  type: "Convolution"
  bottom: "conv5_1_b"
  top: "conv5_2_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_2_b"
  type: "ReLU"
  bottom: "conv5_2_b"
  top: "conv5_2_b"
}
layer {
  name: "conv5_3_b"
  type: "Convolution"
  bottom: "conv5_2_b"
  top: "conv5_3_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_3_b"
  type: "ReLU"
  bottom: "conv5_3_b"
  top: "conv5_3_b"
}
layer {
  name: "roi_pool5_b"
  type: "ROIPooling"
  bottom: "conv5_3_b"
  bottom: "rois"
  top: "pool5_b"
  roi_pooling_param {
    pooled_w: 7
    pooled_h: 7
    #spatial_scale: 0.0625 # 1/16
    spatial_scale: 0.125 # 1/8
  }
}
layer {
  name: "fc6_b"
  type: "InnerProduct"
  bottom: "pool5_b"
  top: "fc6_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu6_b"
  type: "ReLU"
  bottom: "fc6_b"
  top: "fc6_b"
}
layer {
  name: "drop6_b"
  type: "Dropout"
  bottom: "fc6_b"
  top: "fc6_b"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7_b"
  type: "InnerProduct"
  bottom: "fc6_b"
  top: "fc7_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu7_b"
  type: "ReLU"
  bottom: "fc7_b"
  top: "fc7_b"
}
layer {
  name: "drop7_b"
  type: "Dropout"
  bottom: "fc7_b"
  top: "fc7_b"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "cls_score_b"
  type: "InnerProduct"
  bottom: "fc7_b"
  top: "cls_score_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bbox_pred_b"
  type: "InnerProduct"
  bottom: "fc7_b"
  top: "bbox_pred_b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 8
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

########## Branch 3 start with conv3  ###########

layer {
  name: "conv3_1_c"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_1_c"
  type: "ReLU"
  bottom: "conv3_1_c"
  top: "conv3_1_c"
}
layer {
  name: "conv3_2_c"
  type: "Convolution"
  bottom: "conv3_1_c"
  top: "conv3_2_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_2_c"
  type: "ReLU"
  bottom: "conv3_2_c"
  top: "conv3_2_c"
}
layer {
  name: "conv3_3_c"
  type: "Convolution"
  bottom: "conv3_2_c"
  top: "conv3_3_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_3_c"
  type: "ReLU"
  bottom: "conv3_3_c"
  top: "conv3_3_c"
}
layer {
  name: "pool3_c"
  type: "Pooling"
  bottom: "conv3_3_c"
  top: "pool3_c"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1_c"
  type: "Convolution"
  bottom: "pool3_c"
  top: "conv4_1_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_1_c"
  type: "ReLU"
  bottom: "conv4_1_c"
  top: "conv4_1_c"
}
layer {
  name: "conv4_2_c"
  type: "Convolution"
  bottom: "conv4_1_c"
  top: "conv4_2_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_2_c"
  type: "ReLU"
  bottom: "conv4_2_c"
  top: "conv4_2_c"
}
layer {
  name: "conv4_3_c"
  type: "Convolution"
  bottom: "conv4_2_c"
  top: "conv4_3_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_3_c"
  type: "ReLU"
  bottom: "conv4_3_c"
  top: "conv4_3_c"
}
#layer {
#  name: "pool4_c"
#  type: "Pooling"
#  bottom: "conv4_3_c"
#  top: "pool4_c"
#  pooling_param {
#    pool: MAX
#    kernel_size: 2
#    stride: 2
#  }
#}

layer {
  name: "conv5_1_c"
  type: "Convolution"
#  bottom: "pool4_c"
  bottom: "conv4_3_c"
  top: "conv5_1_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_1_c"
  type: "ReLU"
  bottom: "conv5_1_c"
  top: "conv5_1_c"
}
layer {
  name: "conv5_2_c"
  type: "Convolution"
  bottom: "conv5_1_c"
  top: "conv5_2_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_2_c"
  type: "ReLU"
  bottom: "conv5_2_c"
  top: "conv5_2_c"
}
layer {
  name: "conv5_3_c"
  type: "Convolution"
  bottom: "conv5_2_c"
  top: "conv5_3_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_3_c"
  type: "ReLU"
  bottom: "conv5_3_c"
  top: "conv5_3_c"
}
layer {
  name: "roi_pool5_c"
  type: "ROIPooling"
  bottom: "conv5_3_c"
  bottom: "rois"
  top: "pool5_c"
  roi_pooling_param {
    pooled_w: 7
    pooled_h: 7
    #spatial_scale: 0.0625 # 1/16
    spatial_scale: 0.125 # 1/8
  }
}
layer {
  name: "fc6_c"
  type: "InnerProduct"
  bottom: "pool5_c"
  top: "fc6_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu6_c"
  type: "ReLU"
  bottom: "fc6_c"
  top: "fc6_c"
}
layer {
  name: "drop6_c"
  type: "Dropout"
  bottom: "fc6_c"
  top: "fc6_c"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7_c"
  type: "InnerProduct"
  bottom: "fc6_c"
  top: "fc7_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu7_c"
  type: "ReLU"
  bottom: "fc7_c"
  top: "fc7_c"
}
layer {
  name: "drop7_c"
  type: "Dropout"
  bottom: "fc7_c"
  top: "fc7_c"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "cls_score_c"
  type: "InnerProduct"
  bottom: "fc7_c"
  top: "cls_score_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bbox_pred_c"
  type: "InnerProduct"
  bottom: "fc7_c"
  top: "bbox_pred_c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 8
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}


################### classifier layer #####################

layer {
  name: "cls_score_concat"
  bottom: "cls_score"
  bottom: "cls_score_b"
  bottom: "cls_score_c"
  top: "cls_score_concat"
  type: "Concat"
  concat_param {
    axis: 1
  }
}

layer {
  name: "fusion_hidden"
  type: "InnerProduct"
  bottom: "cls_score_concat"
  top: "fusion_hidden"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_fusion"
  type: "ReLU"
  bottom: "fusion_hidden"
  top: "fusion_hidden"
}
layer {
  name: "drop_fusion"
  type: "Dropout"
  bottom: "fusion_hidden"
  top: "fusion_hidden"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "fusion_score"
  type: "InnerProduct"
  bottom: "fusion_hidden"
  top: "cls_score_fusion"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "cls_prob"
  type: "Softmax"
  bottom: "cls_score_fusion"
  top: "cls_prob"
}
